In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('../data/phonebook_dataset.csv', sep=',')

In [3]:
df.head()

   LastName FirstName   MI   PhoneNumber Agency     Room   Building
0  Aaronson    Andrew    C  202-720-5791   WAOB   rm4411   SOAGRIBG
1      Abad    Gloria  NaN  301-851-2125  APHIS  unit133   RIVER-RD
2      Abad     Jorge  NaN  301-851-2227  APHIS  Unit133   RIVER-RD
3      Abad  Patricia  NaN  301-851-2264  APHIS  unit130   RIVER-RD
4     Abbey    Bonita  NaN  202-720-5907    OIG    406-E  WHITTENBG

In [4]:
df = df[['LastName', 'FirstName', 'PhoneNumber']]
df.head()

   LastName FirstName   PhoneNumber
0  Aaronson    Andrew  202-720-5791
1      Abad    Gloria  301-851-2125
2      Abad     Jorge  301-851-2227
3      Abad  Patricia  301-851-2264
4     Abbey    Bonita  202-720-5907

In [5]:
names = df['LastName'].astype(str) + ' ' + df['FirstName'] + ' ----- ' + df['PhoneNumber']

In [6]:
names_df = pd.DataFrame({'Phonebook': names})

In [7]:
names_df.reset_index(drop=True, inplace=True)

In [8]:
names_df.to_csv('../data/phonebook.txt', index=False)